{
  "transform_params" : {
    "face_img" : {
      "bias_a" : 0,
      "bias_g" : -1,
      "bias_r" : -1,
      "bias_b" : -1,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0078431377187371254
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "675",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "676",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "675",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "face_img",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "676",
      "weights" : {
        "params_prelu" : 5
      },
      "mode" : 4,
      "debug_info" : "677",
      "top" : "677",
      "type" : "activation",
      "name" : "677"
    },
    {
      "pad_r" : 0,
      "debug_info" : "678",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "678",
      "top_shape_style" : 0,
      "stride_x" : 2,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "678",
      "pad_t" : 0,
      "stride_y" : 2,
      "bottom" : "677",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "679",
      "bottom" : "677",
      "weights" : {

      },
      "debug_info" : "679",
      "top" : "679",
      "C" : 64,
      "blob_batchnorm_params" : 7,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "680",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "680",
      "blob_weights" : 9,
      "K" : 64,
      "name" : "680",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "679",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "680",
      "weights" : {
        "params_prelu" : 11
      },
      "mode" : 4,
      "debug_info" : "681",
      "top" : "681",
      "type" : "activation",
      "name" : "681"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "682",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "683",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "682",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "681",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "683,678",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "684",
      "top" : "684",
      "type" : "elementwise",
      "name" : "684",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "685",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "685",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "685",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "684",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "686",
      "bottom" : "684",
      "weights" : {

      },
      "debug_info" : "686",
      "top" : "686",
      "C" : 64,
      "blob_batchnorm_params" : 17,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "687",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "687",
      "blob_weights" : 19,
      "K" : 64,
      "name" : "687",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "686",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "687",
      "weights" : {
        "params_prelu" : 21
      },
      "mode" : 4,
      "debug_info" : "688",
      "top" : "688",
      "type" : "activation",
      "name" : "688"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "689",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "690",
      "blob_weights" : 25,
      "K" : 64,
      "blob_biases" : 23,
      "name" : "689",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "688",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "690,685",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "691",
      "top" : "691",
      "type" : "elementwise",
      "name" : "691",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "692",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "692",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "692",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "691",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "693",
      "bottom" : "691",
      "weights" : {

      },
      "debug_info" : "693",
      "top" : "693",
      "C" : 64,
      "blob_batchnorm_params" : 27,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "694",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "694",
      "blob_weights" : 29,
      "K" : 64,
      "name" : "694",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 64,
      "bottom" : "693",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "694",
      "weights" : {
        "params_prelu" : 31
      },
      "mode" : 4,
      "debug_info" : "695",
      "top" : "695",
      "type" : "activation",
      "name" : "695"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "696",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "697",
      "blob_weights" : 35,
      "K" : 64,
      "blob_biases" : 33,
      "name" : "696",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "695",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "697,692",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "698",
      "top" : "698",
      "type" : "elementwise",
      "name" : "698",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "699",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "700",
      "blob_weights" : 39,
      "K" : 64,
      "blob_biases" : 37,
      "stride_x" : 2,
      "name" : "699",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "698",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "name" : "701",
      "bottom" : "698",
      "weights" : {

      },
      "debug_info" : "701",
      "top" : "701",
      "C" : 64,
      "blob_batchnorm_params" : 41,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "702",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "702",
      "blob_weights" : 43,
      "K" : 64,
      "name" : "702",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "701",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "702",
      "weights" : {
        "params_prelu" : 45
      },
      "mode" : 4,
      "debug_info" : "703",
      "top" : "703",
      "type" : "activation",
      "name" : "703"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "704",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "705",
      "blob_weights" : 49,
      "K" : 128,
      "blob_biases" : 47,
      "stride_x" : 2,
      "name" : "704",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "703",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "705,700",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "706",
      "top" : "706",
      "type" : "elementwise",
      "name" : "706",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "707",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "707",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "707",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "706",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "708",
      "bottom" : "706",
      "weights" : {

      },
      "debug_info" : "708",
      "top" : "708",
      "C" : 128,
      "blob_batchnorm_params" : 51,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "709",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "709",
      "blob_weights" : 53,
      "K" : 128,
      "name" : "709",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "708",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "709",
      "weights" : {
        "params_prelu" : 55
      },
      "mode" : 4,
      "debug_info" : "710",
      "top" : "710",
      "type" : "activation",
      "name" : "710"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "711",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "712",
      "blob_weights" : 59,
      "K" : 128,
      "blob_biases" : 57,
      "name" : "711",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "710",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "712,707",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "713",
      "top" : "713",
      "type" : "elementwise",
      "name" : "713",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "714",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "714",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "714",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "713",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "715",
      "bottom" : "713",
      "weights" : {

      },
      "debug_info" : "715",
      "top" : "715",
      "C" : 128,
      "blob_batchnorm_params" : 61,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "716",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "716",
      "blob_weights" : 63,
      "K" : 128,
      "name" : "716",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "715",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "716",
      "weights" : {
        "params_prelu" : 65
      },
      "mode" : 4,
      "debug_info" : "717",
      "top" : "717",
      "type" : "activation",
      "name" : "717"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "718",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "719",
      "blob_weights" : 69,
      "K" : 128,
      "blob_biases" : 67,
      "name" : "718",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "717",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "719,714",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "720",
      "top" : "720",
      "type" : "elementwise",
      "name" : "720",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "721",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "721",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "721",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "720",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "722",
      "bottom" : "720",
      "weights" : {

      },
      "debug_info" : "722",
      "top" : "722",
      "C" : 128,
      "blob_batchnorm_params" : 71,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "723",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "723",
      "blob_weights" : 73,
      "K" : 128,
      "name" : "723",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "722",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "723",
      "weights" : {
        "params_prelu" : 75
      },
      "mode" : 4,
      "debug_info" : "724",
      "top" : "724",
      "type" : "activation",
      "name" : "724"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "725",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "726",
      "blob_weights" : 79,
      "K" : 128,
      "blob_biases" : 77,
      "name" : "725",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "724",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "726,721",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "727",
      "top" : "727",
      "type" : "elementwise",
      "name" : "727",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "728",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "728",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "728",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "727",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "729",
      "bottom" : "727",
      "weights" : {

      },
      "debug_info" : "729",
      "top" : "729",
      "C" : 128,
      "blob_batchnorm_params" : 81,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "730",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "730",
      "blob_weights" : 83,
      "K" : 128,
      "name" : "730",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "729",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "730",
      "weights" : {
        "params_prelu" : 85
      },
      "mode" : 4,
      "debug_info" : "731",
      "top" : "731",
      "type" : "activation",
      "name" : "731"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "732",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "733",
      "blob_weights" : 89,
      "K" : 128,
      "blob_biases" : 87,
      "name" : "732",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "731",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "733,728",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "734",
      "top" : "734",
      "type" : "elementwise",
      "name" : "734",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "735",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "735",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "735",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "734",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "736",
      "bottom" : "734",
      "weights" : {

      },
      "debug_info" : "736",
      "top" : "736",
      "C" : 128,
      "blob_batchnorm_params" : 91,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "737",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "737",
      "blob_weights" : 93,
      "K" : 128,
      "name" : "737",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "736",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "737",
      "weights" : {
        "params_prelu" : 95
      },
      "mode" : 4,
      "debug_info" : "738",
      "top" : "738",
      "type" : "activation",
      "name" : "738"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "739",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "740",
      "blob_weights" : 99,
      "K" : 128,
      "blob_biases" : 97,
      "name" : "739",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "738",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "740,735",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "741",
      "top" : "741",
      "type" : "elementwise",
      "name" : "741",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "742",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "742",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "742",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "741",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "743",
      "bottom" : "741",
      "weights" : {

      },
      "debug_info" : "743",
      "top" : "743",
      "C" : 128,
      "blob_batchnorm_params" : 101,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "744",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "744",
      "blob_weights" : 103,
      "K" : 128,
      "name" : "744",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "743",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "744",
      "weights" : {
        "params_prelu" : 105
      },
      "mode" : 4,
      "debug_info" : "745",
      "top" : "745",
      "type" : "activation",
      "name" : "745"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "746",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "747",
      "blob_weights" : 109,
      "K" : 128,
      "blob_biases" : 107,
      "name" : "746",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "745",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "747,742",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "748",
      "top" : "748",
      "type" : "elementwise",
      "name" : "748",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "749",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "749",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "749",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "748",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "750",
      "bottom" : "748",
      "weights" : {

      },
      "debug_info" : "750",
      "top" : "750",
      "C" : 128,
      "blob_batchnorm_params" : 111,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "751",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "751",
      "blob_weights" : 113,
      "K" : 128,
      "name" : "751",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "750",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "751",
      "weights" : {
        "params_prelu" : 115
      },
      "mode" : 4,
      "debug_info" : "752",
      "top" : "752",
      "type" : "activation",
      "name" : "752"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "753",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "754",
      "blob_weights" : 119,
      "K" : 128,
      "blob_biases" : 117,
      "name" : "753",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "752",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "754,749",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "755",
      "top" : "755",
      "type" : "elementwise",
      "name" : "755",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "756",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "756",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "756",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "755",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "757",
      "bottom" : "755",
      "weights" : {

      },
      "debug_info" : "757",
      "top" : "757",
      "C" : 128,
      "blob_batchnorm_params" : 121,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "758",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "758",
      "blob_weights" : 123,
      "K" : 128,
      "name" : "758",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "757",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "758",
      "weights" : {
        "params_prelu" : 125
      },
      "mode" : 4,
      "debug_info" : "759",
      "top" : "759",
      "type" : "activation",
      "name" : "759"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "760",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "761",
      "blob_weights" : 129,
      "K" : 128,
      "blob_biases" : 127,
      "name" : "760",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "759",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "761,756",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "762",
      "top" : "762",
      "type" : "elementwise",
      "name" : "762",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "763",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "763",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "763",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "762",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "764",
      "bottom" : "762",
      "weights" : {

      },
      "debug_info" : "764",
      "top" : "764",
      "C" : 128,
      "blob_batchnorm_params" : 131,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "765",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "765",
      "blob_weights" : 133,
      "K" : 128,
      "name" : "765",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "764",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "765",
      "weights" : {
        "params_prelu" : 135
      },
      "mode" : 4,
      "debug_info" : "766",
      "top" : "766",
      "type" : "activation",
      "name" : "766"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "767",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "768",
      "blob_weights" : 139,
      "K" : 128,
      "blob_biases" : 137,
      "name" : "767",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "766",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "768,763",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "769",
      "top" : "769",
      "type" : "elementwise",
      "name" : "769",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "770",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "770",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "770",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "769",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "771",
      "bottom" : "769",
      "weights" : {

      },
      "debug_info" : "771",
      "top" : "771",
      "C" : 128,
      "blob_batchnorm_params" : 141,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "772",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "772",
      "blob_weights" : 143,
      "K" : 128,
      "name" : "772",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "771",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "772",
      "weights" : {
        "params_prelu" : 145
      },
      "mode" : 4,
      "debug_info" : "773",
      "top" : "773",
      "type" : "activation",
      "name" : "773"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "774",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "775",
      "blob_weights" : 149,
      "K" : 128,
      "blob_biases" : 147,
      "name" : "774",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "773",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "775,770",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "776",
      "top" : "776",
      "type" : "elementwise",
      "name" : "776",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "777",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "777",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "777",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "776",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "778",
      "bottom" : "776",
      "weights" : {

      },
      "debug_info" : "778",
      "top" : "778",
      "C" : 128,
      "blob_batchnorm_params" : 151,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "779",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "779",
      "blob_weights" : 153,
      "K" : 128,
      "name" : "779",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "778",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "779",
      "weights" : {
        "params_prelu" : 155
      },
      "mode" : 4,
      "debug_info" : "780",
      "top" : "780",
      "type" : "activation",
      "name" : "780"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "781",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "782",
      "blob_weights" : 159,
      "K" : 128,
      "blob_biases" : 157,
      "name" : "781",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "780",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "782,777",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "783",
      "top" : "783",
      "type" : "elementwise",
      "name" : "783",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "784",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "784",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "784",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "783",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "785",
      "bottom" : "783",
      "weights" : {

      },
      "debug_info" : "785",
      "top" : "785",
      "C" : 128,
      "blob_batchnorm_params" : 161,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "786",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "786",
      "blob_weights" : 163,
      "K" : 128,
      "name" : "786",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 128,
      "bottom" : "785",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "786",
      "weights" : {
        "params_prelu" : 165
      },
      "mode" : 4,
      "debug_info" : "787",
      "top" : "787",
      "type" : "activation",
      "name" : "787"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "788",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "789",
      "blob_weights" : 169,
      "K" : 128,
      "blob_biases" : 167,
      "name" : "788",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "787",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "789,784",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "790",
      "top" : "790",
      "type" : "elementwise",
      "name" : "790",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "791",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "792",
      "blob_weights" : 173,
      "K" : 128,
      "blob_biases" : 171,
      "stride_x" : 2,
      "name" : "791",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "790",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "name" : "793",
      "bottom" : "790",
      "weights" : {

      },
      "debug_info" : "793",
      "top" : "793",
      "C" : 128,
      "blob_batchnorm_params" : 175,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "794",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "794",
      "blob_weights" : 177,
      "K" : 128,
      "name" : "794",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "793",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "794",
      "weights" : {
        "params_prelu" : 179
      },
      "mode" : 4,
      "debug_info" : "795",
      "top" : "795",
      "type" : "activation",
      "name" : "795"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "796",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "797",
      "blob_weights" : 183,
      "K" : 256,
      "blob_biases" : 181,
      "stride_x" : 2,
      "name" : "796",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "795",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "797,792",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "798",
      "top" : "798",
      "type" : "elementwise",
      "name" : "798",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "799",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "799",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "799",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "798",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "800",
      "bottom" : "798",
      "weights" : {

      },
      "debug_info" : "800",
      "top" : "800",
      "C" : 256,
      "blob_batchnorm_params" : 185,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "801",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "801",
      "blob_weights" : 187,
      "K" : 256,
      "name" : "801",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "800",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "801",
      "weights" : {
        "params_prelu" : 189
      },
      "mode" : 4,
      "debug_info" : "802",
      "top" : "802",
      "type" : "activation",
      "name" : "802"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "803",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "804",
      "blob_weights" : 193,
      "K" : 256,
      "blob_biases" : 191,
      "name" : "803",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "802",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "804,799",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "805",
      "top" : "805",
      "type" : "elementwise",
      "name" : "805",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "806",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "806",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "806",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "805",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "807",
      "bottom" : "805",
      "weights" : {

      },
      "debug_info" : "807",
      "top" : "807",
      "C" : 256,
      "blob_batchnorm_params" : 195,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "808",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "808",
      "blob_weights" : 197,
      "K" : 256,
      "name" : "808",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "807",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "808",
      "weights" : {
        "params_prelu" : 199
      },
      "mode" : 4,
      "debug_info" : "809",
      "top" : "809",
      "type" : "activation",
      "name" : "809"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "810",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "811",
      "blob_weights" : 203,
      "K" : 256,
      "blob_biases" : 201,
      "name" : "810",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "809",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "811,806",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "812",
      "top" : "812",
      "type" : "elementwise",
      "name" : "812",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "813",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "813",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "813",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "812",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "814",
      "bottom" : "812",
      "weights" : {

      },
      "debug_info" : "814",
      "top" : "814",
      "C" : 256,
      "blob_batchnorm_params" : 205,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "815",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "815",
      "blob_weights" : 207,
      "K" : 256,
      "name" : "815",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "814",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "815",
      "weights" : {
        "params_prelu" : 209
      },
      "mode" : 4,
      "debug_info" : "816",
      "top" : "816",
      "type" : "activation",
      "name" : "816"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "817",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "818",
      "blob_weights" : 213,
      "K" : 256,
      "blob_biases" : 211,
      "name" : "817",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "816",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "818,813",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "819",
      "top" : "819",
      "type" : "elementwise",
      "name" : "819",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "debug_info" : "820",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "size_x" : 1,
      "top" : "820",
      "top_shape_style" : 0,
      "stride_x" : 1,
      "avg_or_max" : 1,
      "average_count_exclude_padding" : 1,
      "type" : "pool",
      "name" : "820",
      "pad_t" : 0,
      "stride_y" : 1,
      "bottom" : "819",
      "weights" : {

      },
      "pad_mode" : 2,
      "size_y" : 1,
      "pad_value" : 0
    },
    {
      "name" : "821",
      "bottom" : "819",
      "weights" : {

      },
      "debug_info" : "821",
      "top" : "821",
      "C" : 256,
      "blob_batchnorm_params" : 215,
      "type" : "batchnorm"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "822",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "822",
      "blob_weights" : 217,
      "K" : 256,
      "name" : "822",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 0,
      "C" : 256,
      "bottom" : "821",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "822",
      "weights" : {
        "params_prelu" : 219
      },
      "mode" : 4,
      "debug_info" : "823",
      "top" : "823",
      "type" : "activation",
      "name" : "823"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "824",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "825",
      "blob_weights" : 223,
      "K" : 256,
      "blob_biases" : 221,
      "name" : "824",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "823",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "825,820",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "826",
      "top" : "826",
      "type" : "elementwise",
      "name" : "826",
