{
  "transform_params" : {
    "face_img" : {
      "bias_a" : 0,
      "bias_g" : -1,
      "bias_r" : -1,
      "bias_b" : -1,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 0.0078431377187371254
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "334",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "335",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "stride_x" : 2,
      "name" : "334",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "face_img",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "335",
      "weights" : {
        "params_prelu" : 5
      },
      "mode" : 4,
      "debug_info" : "336",
      "top" : "336",
      "type" : "activation",
      "name" : "336"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "337",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "338",
      "blob_weights" : 9,
      "K" : 64,
      "blob_biases" : 7,
      "name" : "337",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 64,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "336",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "338",
      "weights" : {
        "params_prelu" : 11
      },
      "mode" : 4,
      "debug_info" : "339",
      "top" : "339",
      "type" : "activation",
      "name" : "339"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "340",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "341",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "name" : "340",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "339",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "341",
      "weights" : {
        "params_prelu" : 17
      },
      "mode" : 4,
      "debug_info" : "342",
      "top" : "342",
      "type" : "activation",
      "name" : "342"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "343",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "344",
      "blob_weights" : 21,
      "K" : 128,
      "blob_biases" : 19,
      "stride_x" : 2,
      "name" : "343",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 128,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "342",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "344",
      "weights" : {
        "params_prelu" : 23
      },
      "mode" : 4,
      "debug_info" : "345",
      "top" : "345",
      "type" : "activation",
      "name" : "345"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "346",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "347",
      "blob_weights" : 27,
      "K" : 128,
      "blob_biases" : 25,
      "name" : "346",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "345",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "348",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "349",
      "blob_weights" : 31,
      "K" : 128,
      "blob_biases" : 29,
      "name" : "348",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "347",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "349",
      "weights" : {
        "params_prelu" : 33
      },
      "mode" : 4,
      "debug_info" : "350",
      "top" : "350",
      "type" : "activation",
      "name" : "350"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "351",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "352",
      "blob_weights" : 37,
      "K" : 256,
      "blob_biases" : 35,
      "name" : "351",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "350",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "352",
      "weights" : {
        "params_prelu" : 39
      },
      "mode" : 4,
      "debug_info" : "353",
      "top" : "353",
      "type" : "activation",
      "name" : "353"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "354",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "355",
      "blob_weights" : 43,
      "K" : 256,
      "blob_biases" : 41,
      "name" : "354",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "353",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "347,355",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "356",
      "top" : "356",
      "type" : "elementwise",
      "name" : "356",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "357",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "358",
      "blob_weights" : 47,
      "K" : 128,
      "blob_biases" : 45,
      "name" : "357",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "356",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "358",
      "weights" : {
        "params_prelu" : 49
      },
      "mode" : 4,
      "debug_info" : "359",
      "top" : "359",
      "type" : "activation",
      "name" : "359"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "360",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "361",
      "blob_weights" : 53,
      "K" : 256,
      "blob_biases" : 51,
      "name" : "360",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "359",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "361",
      "weights" : {
        "params_prelu" : 55
      },
      "mode" : 4,
      "debug_info" : "362",
      "top" : "362",
      "type" : "activation",
      "name" : "362"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "363",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "364",
      "blob_weights" : 59,
      "K" : 256,
      "blob_biases" : 57,
      "name" : "363",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "362",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "356,364",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "365",
      "top" : "365",
      "type" : "elementwise",
      "name" : "365",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "366",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "367",
      "blob_weights" : 63,
      "K" : 128,
      "blob_biases" : 61,
      "name" : "366",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "365",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "367",
      "weights" : {
        "params_prelu" : 65
      },
      "mode" : 4,
      "debug_info" : "368",
      "top" : "368",
      "type" : "activation",
      "name" : "368"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "369",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "370",
      "blob_weights" : 69,
      "K" : 256,
      "blob_biases" : 67,
      "name" : "369",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "368",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "370",
      "weights" : {
        "params_prelu" : 71
      },
      "mode" : 4,
      "debug_info" : "371",
      "top" : "371",
      "type" : "activation",
      "name" : "371"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "372",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "373",
      "blob_weights" : 75,
      "K" : 256,
      "blob_biases" : 73,
      "name" : "372",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "371",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "365,373",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "374",
      "top" : "374",
      "type" : "elementwise",
      "name" : "374",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "375",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "376",
      "blob_weights" : 79,
      "K" : 128,
      "blob_biases" : 77,
      "name" : "375",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "374",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "376",
      "weights" : {
        "params_prelu" : 81
      },
      "mode" : 4,
      "debug_info" : "377",
      "top" : "377",
      "type" : "activation",
      "name" : "377"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "378",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "379",
      "blob_weights" : 85,
      "K" : 256,
      "blob_biases" : 83,
      "name" : "378",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 256,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "377",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "379",
      "weights" : {
        "params_prelu" : 87
      },
      "mode" : 4,
      "debug_info" : "380",
      "top" : "380",
      "type" : "activation",
      "name" : "380"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "381",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "382",
      "blob_weights" : 91,
      "K" : 256,
      "blob_biases" : 89,
      "name" : "381",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "380",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "374,382",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "383",
      "top" : "383",
      "type" : "elementwise",
      "name" : "383",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "384",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "385",
      "blob_weights" : 95,
      "K" : 128,
      "blob_biases" : 93,
      "name" : "384",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "383",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "385",
      "weights" : {
        "params_prelu" : 97
      },
      "mode" : 4,
      "debug_info" : "386",
      "top" : "386",
      "type" : "activation",
      "name" : "386"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "387",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "388",
      "blob_weights" : 101,
      "K" : 512,
      "blob_biases" : 99,
      "stride_x" : 2,
      "name" : "387",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "386",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "388",
      "weights" : {
        "params_prelu" : 103
      },
      "mode" : 4,
      "debug_info" : "389",
      "top" : "389",
      "type" : "activation",
      "name" : "389"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "390",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "391",
      "blob_weights" : 107,
      "K" : 512,
      "blob_biases" : 105,
      "name" : "390",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "389",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "392",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "393",
      "blob_weights" : 111,
      "K" : 256,
      "blob_biases" : 109,
      "name" : "392",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "391",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "393",
      "weights" : {
        "params_prelu" : 113
      },
      "mode" : 4,
      "debug_info" : "394",
      "top" : "394",
      "type" : "activation",
      "name" : "394"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "395",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "396",
      "blob_weights" : 117,
      "K" : 512,
      "blob_biases" : 115,
      "name" : "395",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "394",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "396",
      "weights" : {
        "params_prelu" : 119
      },
      "mode" : 4,
      "debug_info" : "397",
      "top" : "397",
      "type" : "activation",
      "name" : "397"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "398",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "399",
      "blob_weights" : 123,
      "K" : 512,
      "blob_biases" : 121,
      "name" : "398",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "397",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "391,399",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "400",
      "top" : "400",
      "type" : "elementwise",
      "name" : "400",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "401",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "402",
      "blob_weights" : 127,
      "K" : 256,
      "blob_biases" : 125,
      "name" : "401",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "400",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "402",
      "weights" : {
        "params_prelu" : 129
      },
      "mode" : 4,
      "debug_info" : "403",
      "top" : "403",
      "type" : "activation",
      "name" : "403"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "404",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "405",
      "blob_weights" : 133,
      "K" : 512,
      "blob_biases" : 131,
      "name" : "404",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "403",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "405",
      "weights" : {
        "params_prelu" : 135
      },
      "mode" : 4,
      "debug_info" : "406",
      "top" : "406",
      "type" : "activation",
      "name" : "406"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "407",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "408",
      "blob_weights" : 139,
      "K" : 512,
      "blob_biases" : 137,
      "name" : "407",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "406",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "400,408",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "409",
      "top" : "409",
      "type" : "elementwise",
      "name" : "409",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "410",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "411",
      "blob_weights" : 143,
      "K" : 256,
      "blob_biases" : 141,
      "name" : "410",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "409",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "411",
      "weights" : {
        "params_prelu" : 145
      },
      "mode" : 4,
      "debug_info" : "412",
      "top" : "412",
      "type" : "activation",
      "name" : "412"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "413",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "414",
      "blob_weights" : 149,
      "K" : 512,
      "blob_biases" : 147,
      "name" : "413",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "412",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "414",
      "weights" : {
        "params_prelu" : 151
      },
      "mode" : 4,
      "debug_info" : "415",
      "top" : "415",
      "type" : "activation",
      "name" : "415"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "416",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "417",
      "blob_weights" : 155,
      "K" : 512,
      "blob_biases" : 153,
      "name" : "416",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "415",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "409,417",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "418",
      "top" : "418",
      "type" : "elementwise",
      "name" : "418",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "419",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "420",
      "blob_weights" : 159,
      "K" : 256,
      "blob_biases" : 157,
      "name" : "419",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "418",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "420",
      "weights" : {
        "params_prelu" : 161
      },
      "mode" : 4,
      "debug_info" : "421",
      "top" : "421",
      "type" : "activation",
      "name" : "421"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "422",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "423",
      "blob_weights" : 165,
      "K" : 512,
      "blob_biases" : 163,
      "name" : "422",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "421",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "423",
      "weights" : {
        "params_prelu" : 167
      },
      "mode" : 4,
      "debug_info" : "424",
      "top" : "424",
      "type" : "activation",
      "name" : "424"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "425",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "426",
      "blob_weights" : 171,
      "K" : 512,
      "blob_biases" : 169,
      "name" : "425",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "424",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "418,426",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "427",
      "top" : "427",
      "type" : "elementwise",
      "name" : "427",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "428",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "429",
      "blob_weights" : 175,
      "K" : 256,
      "blob_biases" : 173,
      "name" : "428",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "427",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "429",
      "weights" : {
        "params_prelu" : 177
      },
      "mode" : 4,
      "debug_info" : "430",
      "top" : "430",
      "type" : "activation",
      "name" : "430"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "431",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "432",
      "blob_weights" : 181,
      "K" : 512,
      "blob_biases" : 179,
      "name" : "431",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "430",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "432",
      "weights" : {
        "params_prelu" : 183
      },
      "mode" : 4,
      "debug_info" : "433",
      "top" : "433",
      "type" : "activation",
      "name" : "433"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "434",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "435",
      "blob_weights" : 187,
      "K" : 512,
      "blob_biases" : 185,
      "name" : "434",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "433",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "427,435",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "436",
      "top" : "436",
      "type" : "elementwise",
      "name" : "436",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "437",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "438",
      "blob_weights" : 191,
      "K" : 256,
      "blob_biases" : 189,
      "name" : "437",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "436",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "438",
      "weights" : {
        "params_prelu" : 193
      },
      "mode" : 4,
      "debug_info" : "439",
      "top" : "439",
      "type" : "activation",
      "name" : "439"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "440",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "441",
      "blob_weights" : 197,
      "K" : 512,
      "blob_biases" : 195,
      "name" : "440",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "439",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "441",
      "weights" : {
        "params_prelu" : 199
      },
      "mode" : 4,
      "debug_info" : "442",
      "top" : "442",
      "type" : "activation",
      "name" : "442"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "443",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "444",
      "blob_weights" : 203,
      "K" : 512,
      "blob_biases" : 201,
      "name" : "443",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "442",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "436,444",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "445",
      "top" : "445",
      "type" : "elementwise",
      "name" : "445",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "446",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "447",
      "blob_weights" : 207,
      "K" : 256,
      "blob_biases" : 205,
      "name" : "446",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "445",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "447",
      "weights" : {
        "params_prelu" : 209
      },
      "mode" : 4,
      "debug_info" : "448",
      "top" : "448",
      "type" : "activation",
      "name" : "448"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "449",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "450",
      "blob_weights" : 213,
      "K" : 1024,
      "blob_biases" : 211,
      "stride_x" : 2,
      "name" : "449",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1024,
      "pad_t" : 1,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 1024,
      "bottom" : "448",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "450",
      "weights" : {
        "params_prelu" : 215
      },
      "mode" : 4,
      "debug_info" : "451",
      "top" : "451",
      "type" : "activation",
      "name" : "451"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "452",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "453",
      "blob_weights" : 219,
      "K" : 1024,
      "blob_biases" : 217,
      "name" : "452",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "451",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "454",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "455",
      "blob_weights" : 223,
      "K" : 256,
      "blob_biases" : 221,
      "name" : "454",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "453",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "455",
      "weights" : {
        "params_prelu" : 225
      },
      "mode" : 4,
      "debug_info" : "456",
      "top" : "456",
      "type" : "activation",
      "name" : "456"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "457",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "458",
      "blob_weights" : 229,
      "K" : 512,
      "blob_biases" : 227,
      "name" : "457",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "456",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "458",
      "weights" : {
        "params_prelu" : 231
      },
      "mode" : 4,
      "debug_info" : "459",
      "top" : "459",
      "type" : "activation",
      "name" : "459"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "460",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "461",
      "blob_weights" : 235,
      "K" : 512,
      "blob_biases" : 233,
      "name" : "460",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "459",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "453,461",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "462",
      "top" : "462",
      "type" : "elementwise",
      "name" : "462",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "463",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "464",
      "blob_weights" : 239,
      "K" : 256,
      "blob_biases" : 237,
      "name" : "463",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "462",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "464",
      "weights" : {
        "params_prelu" : 241
      },
      "mode" : 4,
      "debug_info" : "465",
      "top" : "465",
      "type" : "activation",
      "name" : "465"
    },
    {
      "pad_r" : 1,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "466",
      "pad_fill_mode" : 0,
      "pad_b" : 1,
      "pad_l" : 1,
      "top" : "467",
      "blob_weights" : 245,
      "K" : 512,
      "blob_biases" : 243,
      "name" : "466",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 1,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "465",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "bottom" : "467",
      "weights" : {
        "params_prelu" : 247
      },
      "mode" : 4,
      "debug_info" : "468",
      "top" : "468",
      "type" : "activation",
      "name" : "468"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "469",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "470",
      "blob_weights" : 251,
      "K" : 512,
      "blob_biases" : 249,
      "name" : "469",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 256,
      "bottom" : "468",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "462,470",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "471",
      "top" : "471",
      "type" : "elementwise",
      "name" : "471",
      "beta" : 0
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "472",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "473",
      "blob_weights" : 255,
      "K" : 256,
      "blob_biases" : 253,
      "name" : "472",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "471",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "473",
      "weights" : {
        "params_prelu" : 257
      },
      "mode" : 4,
      "debug_info" : "474",
      "top" : "474",
      "type" : "activation",
      "name" : "474"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "475",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "476",
      "blob_weights" : 261,
      "K" : 512,
      "blob_biases" : 259,
      "name" : "475",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 512,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "474",
      "weights" : {

      },
      "Nx" : 7,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 7,
      "n_parallel" : 1
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "477",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "478",
      "blob_weights" : 265,
      "K" : 512,
      "blob_biases" : 263,
      "name" : "477",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 512,
      "bottom" : "476",
      "weights" : {

      },
      "Nx" : 1,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 1,
      "n_parallel" : 1
    },
    {
      "bottom" : "478",
      "weights" : {

      },
      "mode" : 0,
      "nd_axis" : 0,
      "debug_info" : "face_feature",
      "top" : "face_feature",
      "type" : "flatten",
      "name" : "face_feature",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}