<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>files</key>
	<dict>
		<key>FaceData.momd/FaceData.mom</key>
		<data>
		VxMpqs8c6NCpTKR2iJvAAZxDuCs=
		</data>
		<key>FaceData.momd/VersionInfo.plist</key>
		<data>
		4v+sl4/6arkWE/85fGHIK4YY1AQ=
		</data>
		<key>Headers/FaceCore-Swift.h</key>
		<data>
		SHbHCMkf5x58s0trqIAe/7A3y9o=
		</data>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/analytics/coremldata.bin</key>
		<data>
		AP6lLDCnlysoBCG+3sH0Mkgt09Q=
		</data>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/coremldata.bin</key>
		<data>
		SF4ceRAb0ZRdpgUUwFo6/s2C/cQ=
		</data>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/metadata.json</key>
		<data>
		uDhYbPIjdSJziC8HL4hxsihlRsk=
		</data>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/model.espresso.net</key>
		<data>
		W6jFaOcyEGxGdoMHPIEHS73ET1Q=
		</data>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/model.espresso.shape</key>
		<data>
		OYWGS9qhTwCDErZa/uMdemMdr6A=
		</data>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/model.espresso.weights</key>
		<data>
		FrzI6DJ+IFXqWtlyirPA8qyO42g=
		</data>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/model/coremldata.bin</key>
		<data>
		KNIlIHMkZUAJ3jTwa9K/xk/ZcmM=
		</data>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>Info.plist</key>
		<data>
		SYk+CCMl43IFH9PdXaZL9jqgqjQ=
		</data>
		<key>Modules/FaceCore.swiftmodule/Project/arm64-apple-ios.swiftsourceinfo</key>
		<data>
		ugayOXZnahc8Lf61/Swq6MOkeDI=
		</data>
		<key>Modules/FaceCore.swiftmodule/Project/arm64.swiftsourceinfo</key>
		<data>
		ugayOXZnahc8Lf61/Swq6MOkeDI=
		</data>
		<key>Modules/FaceCore.swiftmodule/arm64-apple-ios.swiftdoc</key>
		<data>
		ux+aasRNK+ErL4Pae3chvIOnX8Y=
		</data>
		<key>Modules/FaceCore.swiftmodule/arm64-apple-ios.swiftmodule</key>
		<data>
		KlACxsB9ZP3LZq6kc/fzHOOMhzo=
		</data>
		<key>Modules/FaceCore.swiftmodule/arm64.swiftdoc</key>
		<data>
		ux+aasRNK+ErL4Pae3chvIOnX8Y=
		</data>
		<key>Modules/FaceCore.swiftmodule/arm64.swiftmodule</key>
		<data>
		KlACxsB9ZP3LZq6kc/fzHOOMhzo=
		</data>
		<key>Modules/module.modulemap</key>
		<data>
		ZrALdb3YbD6CRbJtdc4QaEEsrbg=
		</data>
		<key>PrivateHeaders/CVWrapper.h</key>
		<data>
		waCZi34z07ufqmoIqafmWwvjzxA=
		</data>
		<key>PrivateHeaders/FaceCore.h</key>
		<data>
		ruKjCOVkq8nqcZu6A72D3aRFImA=
		</data>
		<key>antispoof_depth_svc.mlmodelc/analytics/coremldata.bin</key>
		<data>
		gMXkvfIu4iO4gB+LzVlKGoO2aGU=
		</data>
		<key>antispoof_depth_svc.mlmodelc/coremldata.bin</key>
		<data>
		v/y2mSexaar6worLs5I8tQLjvgM=
		</data>
		<key>antispoof_depth_svc.mlmodelc/metadata.json</key>
		<data>
		zoa07SCNMnqI5bn0HKAIVlzzNCo=
		</data>
		<key>det1.bin</key>
		<data>
		SCPFEfgNGeX/R8SFzU5Uq4vaX1U=
		</data>
		<key>det1.param</key>
		<data>
		UemapGfNllDMgn2xa465lmYg1Zk=
		</data>
		<key>det2.bin</key>
		<data>
		6lRfULa/KoSotU9m7UCMroKTvI0=
		</data>
		<key>det2.param</key>
		<data>
		Vp1LVQcjU+gDgFAbgYGAh6Tipf0=
		</data>
		<key>det3.bin</key>
		<data>
		0dfLOUu+WOE7SmB9mhfi3nFPwPo=
		</data>
		<key>det3.param</key>
		<data>
		y+nTxl8Xm++ohaNXc1/rpozvzko=
		</data>
		<key>mobile_face.mlmodelc/analytics/coremldata.bin</key>
		<data>
		RpUlzwhkg7ayOo29xP6y6SnAgTA=
		</data>
		<key>mobile_face.mlmodelc/coremldata.bin</key>
		<data>
		XFpQHVMofnYfEthtkk3VvD9Je2I=
		</data>
		<key>mobile_face.mlmodelc/metadata.json</key>
		<data>
		kbuCMzn0iIlNgbd5E4Iy8ft8a/w=
		</data>
		<key>mobile_face.mlmodelc/model.espresso.net</key>
		<data>
		A9RJcXv14bfc439Se7aWB4DgdUc=
		</data>
		<key>mobile_face.mlmodelc/model.espresso.shape</key>
		<data>
		FSnyVMu37bh/Ty3hVxqpTyrVW/k=
		</data>
		<key>mobile_face.mlmodelc/model.espresso.weights</key>
		<data>
		ndyBiWSJoJEB2SgBlGtvHv8YRHk=
		</data>
		<key>mobile_face.mlmodelc/model/coremldata.bin</key>
		<data>
		y9gBJgmBhz4QDRRb/ZOqrEmExTM=
		</data>
		<key>mobile_face.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/analytics/coremldata.bin</key>
		<data>
		tGIAu20wz1w7p4sJCn8GW4N7DRk=
		</data>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/coremldata.bin</key>
		<data>
		SF4ceRAb0ZRdpgUUwFo6/s2C/cQ=
		</data>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/metadata.json</key>
		<data>
		Uem7rnm0PVykFDjQvbERAPKS9ys=
		</data>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/model.espresso.net</key>
		<data>
		f8kVs8fGkquDlfT+00L2sIo07xg=
		</data>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/model.espresso.shape</key>
		<data>
		oX4FyRJ7WvXPfGimbBmkALTi4eo=
		</data>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/model.espresso.weights</key>
		<data>
		X4EXDBgX6CDeCozlX+qtIZB2Llo=
		</data>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/model/coremldata.bin</key>
		<data>
		KNIlIHMkZUAJ3jTwa9K/xk/ZcmM=
		</data>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<data>
		uA3l0Th1hUHF8FJlrRRKufqG0ds=
		</data>
	</dict>
	<key>files2</key>
	<dict>
		<key>FaceData.momd/FaceData.mom</key>
		<dict>
			<key>hash2</key>
			<data>
			wtfMa5THhR4lo4HLVdscEnf7xkwKaH2aGef4awqk1gg=
			</data>
		</dict>
		<key>FaceData.momd/VersionInfo.plist</key>
		<dict>
			<key>hash2</key>
			<data>
			Yd7DVkIjnB9BDioxB8g0qkCiXO0x/mb8z2d2AQsIV64=
			</data>
		</dict>
		<key>Headers/FaceCore-Swift.h</key>
		<dict>
			<key>hash2</key>
			<data>
			97ZCx5aYo55O0392GYy/Wwd7vr7V9Us9WJ9xkNGSIpk=
			</data>
		</dict>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			AnqiVdHkHkqQ3YbzD39NXzEDHAhLJ/iHHBNIrRpWoII=
			</data>
		</dict>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			iXOdeI7dI4wvSY0IYoYuwA5MF4ziVNPVKLtdh8tRDHU=
			</data>
		</dict>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			nIbuM0P+34eJo9AH6tXO1EXMudCLQDoR/Hq7JD9tawY=
			</data>
		</dict>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			p6fL9dYWCU8OSFwQd39bANzIDkjfEIwuZ8zHhxbgVcY=
			</data>
		</dict>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			tPZ5JFxHC7UdfR76uAo8+of1Cvx5b9tSi+4dyeG31nU=
			</data>
		</dict>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			gV+192kcHReHWxpw+hp5KdhFeJpnnX1r6T50fLISjKY=
			</data>
		</dict>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			xpp/RJHAXLtXfAUB2VW+yw+cZTsBuakxZQaEciL508I=
			</data>
		</dict>
		<key>IR_101_MS1M_ms1m_0918.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>Modules/FaceCore.swiftmodule/Project/arm64-apple-ios.swiftsourceinfo</key>
		<dict>
			<key>hash2</key>
			<data>
			qBZuTLMxeY03AUN1HgQqB9HvPwFRDTyOSg4vl9fzP7Q=
			</data>
		</dict>
		<key>Modules/FaceCore.swiftmodule/Project/arm64.swiftsourceinfo</key>
		<dict>
			<key>hash2</key>
			<data>
			qBZuTLMxeY03AUN1HgQqB9HvPwFRDTyOSg4vl9fzP7Q=
			</data>
		</dict>
		<key>Modules/FaceCore.swiftmodule/arm64-apple-ios.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			m7OMf3zOsqMfmzatCft9Y57iQKENwzOmCqmMBxdWZ4E=
			</data>
		</dict>
		<key>Modules/FaceCore.swiftmodule/arm64-apple-ios.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			4gAKC9WeDDiQIrv6rHdFvaZvxroaPgsLPpTS/jyUkqU=
			</data>
		</dict>
		<key>Modules/FaceCore.swiftmodule/arm64.swiftdoc</key>
		<dict>
			<key>hash2</key>
			<data>
			m7OMf3zOsqMfmzatCft9Y57iQKENwzOmCqmMBxdWZ4E=
			</data>
		</dict>
		<key>Modules/FaceCore.swiftmodule/arm64.swiftmodule</key>
		<dict>
			<key>hash2</key>
			<data>
			4gAKC9WeDDiQIrv6rHdFvaZvxroaPgsLPpTS/jyUkqU=
			</data>
		</dict>
		<key>Modules/module.modulemap</key>
		<dict>
			<key>hash2</key>
			<data>
			Jd748ONNBvbR93Sj1g+6Bd3wzvJvv+ED/d6Q5LvAzuY=
			</data>
		</dict>
		<key>PrivateHeaders/CVWrapper.h</key>
		<dict>
			<key>hash2</key>
			<data>
			b08/marf2S7O6pPFA4qL6JI/gqBwrzpjzawzNKm7YBQ=
			</data>
		</dict>
		<key>PrivateHeaders/FaceCore.h</key>
		<dict>
			<key>hash2</key>
			<data>
			OOiYuyKBfjZYfo6YzofHyrtoai3OkYVne6HzNlJDfvc=
			</data>
		</dict>
		<key>antispoof_depth_svc.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			yXywXxPnHbe8OpNmwDnDKQfJdULh3Z3Zxlcze40NnWM=
			</data>
		</dict>
		<key>antispoof_depth_svc.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			nujMj064ts0ZnsovUMnJ8xpH7+N7jat5gFAD3g8LFzg=
			</data>
		</dict>
		<key>antispoof_depth_svc.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			jqy4sU4+40tQ/SKpZ0LB6LqjvQ/4lUa5G/EdG/LStlo=
			</data>
		</dict>
		<key>det1.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			je39xeNzeNIxMabLkdHgpEbst3UeLT6t1fCG/fGLXOw=
			</data>
		</dict>
		<key>det1.param</key>
		<dict>
			<key>hash2</key>
			<data>
			qTOOIH27qnrVZiVJK1Ua607K8QrCedCYsC8XsKYrHgs=
			</data>
		</dict>
		<key>det2.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			FaP3353HzB7Al2+tNu9YEovxtd6MKr+0Kuci6APb2EI=
			</data>
		</dict>
		<key>det2.param</key>
		<dict>
			<key>hash2</key>
			<data>
			6fYUySOz/t4Cwja+AkZGXoOjSzfO7QvCvLa/2jJGHSU=
			</data>
		</dict>
		<key>det3.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			k/0uuPRw3aqpcz5f4TIr3bGjhAe5C97BzTgIhcFSWWI=
			</data>
		</dict>
		<key>det3.param</key>
		<dict>
			<key>hash2</key>
			<data>
			t/52d9SEBneqDqVpDHAYYwzI1KZhvpUpD+JoFJIL+tQ=
			</data>
		</dict>
		<key>mobile_face.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			sNbdKBjrDg+xzun7c1/HDybxCawE+4PlKmoSG7s+9pw=
			</data>
		</dict>
		<key>mobile_face.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			DDczke8jEA1QqZKEMuInYh1cbQJjNovOW6OMp8D2Iao=
			</data>
		</dict>
		<key>mobile_face.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			zLRKnKW4LZ+eB8TMZqNVmOrFxXe8a6adkkaPGu+vQ0I=
			</data>
		</dict>
		<key>mobile_face.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			busPLlPuuhQ47Fr1vyr3/zB1L6plTGynjHSG1gnm0ss=
			</data>
		</dict>
		<key>mobile_face.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			2N28TYvCrl9hD2kS7yhLnlHqlBtqd29B2Bko0DA4EwE=
			</data>
		</dict>
		<key>mobile_face.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			HAa+5pYSbhcw0NVwELwI4X2FCWE6cINlcFZfd3d4oEY=
			</data>
		</dict>
		<key>mobile_face.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			fs5uF+jSkgO2VrJZcd9ZwNxrbeVe53gWibRetC+QYAc=
			</data>
		</dict>
		<key>mobile_face.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/analytics/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			8nP32/7kyuzELpELdvplzKb+DpW8pwSLDjHQQ8ROysE=
			</data>
		</dict>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			iXOdeI7dI4wvSY0IYoYuwA5MF4ziVNPVKLtdh8tRDHU=
			</data>
		</dict>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/metadata.json</key>
		<dict>
			<key>hash2</key>
			<data>
			dIgMGViQ/F+gK0uHt1pL6qdyTeFbnspGkcHRiywHXFg=
			</data>
		</dict>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/model.espresso.net</key>
		<dict>
			<key>hash2</key>
			<data>
			Yfhkz81zjnP7tc8WD6tc2HCM0foISYjEwsrb3/offLQ=
			</data>
		</dict>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/model.espresso.shape</key>
		<dict>
			<key>hash2</key>
			<data>
			/h6yaP6vYsCxHtBmNPgl+Kyc3IW6m32UNWsgl5w2wA4=
			</data>
		</dict>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/model.espresso.weights</key>
		<dict>
			<key>hash2</key>
			<data>
			I5V38q5xzBxOvauzJnc5S+2wJTboVjl0jdeq97faF6A=
			</data>
		</dict>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/model/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			xpp/RJHAXLtXfAUB2VW+yw+cZTsBuakxZQaEciL508I=
			</data>
		</dict>
		<key>mobilefacenet2X_ms1m_0517_v2.mlmodelc/neural_network_optionals/coremldata.bin</key>
		<dict>
			<key>hash2</key>
			<data>
			LDTOHfI7g4xavyp/ZDfMo9MGftUJ/yXxHfaxG1grUes=
			</data>
		</dict>
	</dict>
	<key>rules</key>
	<dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^version.plist$</key>
		<true/>
	</dict>
	<key>rules2</key>
	<dict>
		<key>.*\.dSYM($|/)</key>
		<dict>
			<key>weight</key>
			<real>11</real>
		</dict>
		<key>^(.*/)?\.DS_Store$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>2000</real>
		</dict>
		<key>^.*</key>
		<true/>
		<key>^.*\.lproj/</key>
		<dict>
			<key>optional</key>
			<true/>
			<key>weight</key>
			<real>1000</real>
		</dict>
		<key>^.*\.lproj/locversion.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>1100</real>
		</dict>
		<key>^Base\.lproj/</key>
		<dict>
			<key>weight</key>
			<real>1010</real>
		</dict>
		<key>^Info\.plist$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^PkgInfo$</key>
		<dict>
			<key>omit</key>
			<true/>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^embedded\.provisionprofile$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
		<key>^version\.plist$</key>
		<dict>
			<key>weight</key>
			<real>20</real>
		</dict>
	</dict>
</dict>
</plist>
